/* Includes ------------------------------------------------------------------*/
#include "adc_reader.h"

Adc_t ADC_0;//ADC通道0
Adc_t ADC_2;//ADC通道2
uint16_t ADC0Value=0,ADC2Value=0;//ADC通道0和通道2寄存器数值
float VoltageValue=0.0f,VoltageValue2=0.0f;//ADC通道0和通道2电压值（单位：V）

/**********************************************************************************************
*函数：void ADCS_Init()
*功能：初始化ADC通道0和通道2
*输入：无
*输出：无
*特殊说明：无
**********************************************************************************************/
void ADCS_Init(void) {
    AdcInit( &ADC_0, PA_0 );
    AdcInit( &ADC_2, PA_2 );
}

/**********************************************************************************************
*函数：void AdcScanChannel()
*功能：转换ADC双信道寄存器数据为电压值
*输入：无
*输出：无
*特殊说明：无
**********************************************************************************************/
void AdcScanChannel(void) {
    ADC0Value=AdcReadChannel( &ADC_0, 0 );
    VoltageValue=(ADC0Value/4096.0)*3.3;

    ADC2Value=AdcReadChannel( &ADC_2, 2 );
    VoltageValue2=(ADC2Value/4096.0)*3.3;
}

/**********************************************************************************************
*函数：float AdcReadCh0()
*功能：获得ADC0获得电压值
*输入：无
*输出：无
*特殊说明：无
**********************************************************************************************/
float AdcReadCh0() {
    return VoltageValue;
}

/**********************************************************************************************
*函数：float AdcReadCh2()
*功能：获得ADC2获得电压值
*输入：无
*输出：无
*特殊说明：无
**********************************************************************************************/
float AdcReadCh2() {
    return VoltageValue2;
}
